MPS/src/Catalogs/ТочкиСценарияОжидание/ТочкиСценарияОжидание.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТочкиСценарияОжидание</name>
  <owners>Catalog.Сценарии</owners>
  <attributes>
    <name>ВидТочкиОжидания</name>
    <type>
      <types>EnumRef.ВидыТочкиОжидания</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПериодовДействия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодДействия</name>
    <type>
      <types>EnumRef.ПериодыДействий</types>
    </type>
  </attributes>
  <attributes>
    <name>ГраницаСрабатыванияДинамически</name>
    <type>
      <types>EnumRef.ПередСразуПосле</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолеКлиентаДляДинамического</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОграничитьПоВремени</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеОграничиватьВремяСрабатывания</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧасовойПояс</name>
    <type>
      <types>CatalogRef.ЧасовыеПояса</types>
    </type>
  </attributes>
  <attributes>
    <name>ДниНедели</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

MPS/src/Enums/ВидыТочкиОжидания/ВидыТочкиОжидания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыТочкиОжидания</name>
  <enumValues>
    <name>Фиксированное</name>
  </enumValues>
  <enumValues>
    <name>Динамическое</name>
  </enumValues>
  <enumValues>
    <name>Интервал</name>
  </enumValues>
</mdclass:Enum>

MPS/src/Catalogs/ТочкиСценарияОжидание/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УправлениеФормой();
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ФормыСлужебныйПКМП.ДеньНеделиВремяПриСозданииФормы(ЭтотОбъект);
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Для ПозДеньНедели = 1 по СтрДлина(Объект.ДниНедели) Цикл
			КнопкаДня = Элементы["ДеньНедели"+Сред(Объект.ДниНедели,ПозДеньНедели,1)];
			КнопкаДня.Пометка = Истина;
			КнопкаДня.ЦветФона = Новый Цвет(72,215,44);
		КонецЦИкла;	
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеФормой()
	
//	Фиксированное = (Объект.ВидТочкиОжидания = ПредопределенноеЗначение("Перечисление.ВидыТочкиОжидания.Фиксированное"));
	Динамическое = (Объект.ВидТочкиОжидания = ПредопределенноеЗначение("Перечисление.ВидыТочкиОжидания.Динамическое"));
	Интервал = (Объект.ВидТочкиОжидания = ПредопределенноеЗначение("Перечисление.ВидыТочкиОжидания.Интервал"));
	
	Элементы.ГруппаДеньНеделиВремя.Видимость = Объект.ОграничитьПоВремени или Интервал;
	Подключаемая_НеОграничиватьВремяСрабатыванияПриИзменении(Неопределено);
	
	Элементы.ГруппаДинамическое.Видимость = Динамическое;
	Элементы.ОграничитьПоВремени.Видимость = не Интервал;
	
КонецПроцедуры	

&НаКлиенте
Процедура ВидТочкиОжиданияПриИзменении(Элемент)
	УправлениеФормой();
КонецПроцедуры

&НаКлиенте
Процедура ОграничитьПоВремениПриИзменении(Элемент)
	УправлениеФормой();
КонецПроцедуры


&НаКлиенте 
Процедура Подключаемая_НеОграничиватьВремяСрабатыванияПриИзменении(Элемент)
	
	Элементы.ГруппаВремя.Видимость = не Объект.НеОграничиватьВремяСрабатывания;
	
КонецПроцедуры	
	
&НаКлиенте 
Процедура Подключаемая_ВыбратьДеньНедели(Команда)
	
	АктивнаяКнопка = ТекущийЭлемент;
	Если не ТипЗнч(АктивнаяКнопка) = Тип("КнопкаФормы") Тогда
		Возврат;
	КонецЕсли;
	
	АктивнаяКнопка.Пометка = не 	АктивнаяКнопка.Пометка;
	
	АктивнаяКнопка.ЦветФона = ?(АктивнаяКнопка.Пометка,Новый Цвет(72,215,44),Новый Цвет);
	
	Объект.ДниНедели = "";
	Для ДеньНедели = 1 по 7 Цикл
		Если Элементы["ДеньНедели"+ДеньНедели].Пометка Тогда
			Объект.ДниНедели = Объект.ДниНедели + ДеньНедели;
		КонецЕсли;	
	КонецЦикла;	
	
КонецПроцедуры
